---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.Dispose
source: html/df012c0e-33ee-7b9b-a442-6f3e62fe905b.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData.Dispose Method

Releases all resources used by the PipeFittingAndAccessoryPressureDropData

## Syntax (C#)
```csharp
public void Dispose()
```